miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_dma.c
    /* Call R_DTC_Create(). */
    R_DTC_Create((dtc_activation_source_t)vect, &g_usb_dtc_transfer_data[dma_ch], &td_cfg, 0);

    if ((USB_IP0 == ip) && (USB_D0DMA == useport))
    {
        /* DTC start enable register (USB0 D0FIFO transfer enable)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
        DTCE (USB0, D0FIFO0) = 1;
        IPR (USB0, D0FIFO0) = 4u;                   /* D0FIFO0 Enable */
    }
    else if ((USB_IP0 == ip) && (USB_D1DMA == useport))
    {
        /* DTC start enable register (USBA D0FIFO transfer enable)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
        DTCE (USB0, D1FIFO0) = 1;
        IPR (USB0, D1FIFO0) = 4u;                   /* D0FIFO0 Enable */
    }
    else if ((USB_IP1 == ip) && (USB_D0DMA == useport))
    {
        /* DTC start enable register (USBA D0FIFO transfer enable)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        DTCE (USBA, D0FIFO2) = 1;
        IPR (USBA, D0FIFO2) = 4u;                   /* D0FIFO0 Enable */

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
        DTCE (USB1, D0FIFO1) = 1;
        IPR (USB1, D0FIFO1) = 4u;                   /* D0FIFO0 Enable */

#endif  /* defined(BSP_MCU_RX63N) */
    }
    else if ((USB_IP1 == ip) && (USB_D1DMA == useport))
    {
        /* DTC start enable register (USBA D0FIFO transfer enable)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        DTCE (USBA, D1FIFO2) = 1;
        IPR (USBA, D1FIFO2) = 4u;                   /* D0FIFO0 Enable */

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
        DTCE (USB1, D1FIFO1) = 1;
        IPR (USB1, D1FIFO1) = 4u;                   /* D0FIFO0 Enable */

#endif  /* defined(BSP_MCU_RX63N) */
    }
    else
    {
    }
}
/******************************************************************************
End of function usb_dma_buf2dxfifo_setting
******************************************************************************/
#endif /* USB_CFG_DTC == USB_CFG_ENABLE */

#if USB_CFG_DMA == USB_CFG_ENABLE
/******************************************************************************
Function Name   : usb_dma_dxfifo2buf_setting
Description     : FIFO to Buffer data read DMA start
Arguments       : usb_utr_t *ptr         : Pointer to usb_utr_t structure
                : uint32_t des_addr      : Source address
                : uint16_t useport       : FIFO Access mode
                : uint32_t transfer_size : Transfer size
Return value    : void
******************************************************************************/
void usb_dma_dxfifo2buf_setting(usb_utr_t *ptr, uint32_t des_addr, uint16_t useport, uint32_t transfer_size)
{
    volatile dmaca_return_t     ret;
    dmaca_transfer_data_cfg_t   td_cfg;
    dmaca_stat_t                dmac_status;
    uint32_t                    fifo_address;
    uint8_t                     dma_ch;
    uint16_t                    vect;
    uint16_t                    fifo_mode;
    uint16_t                    ip;
    uint16_t                    transfer_count;
    uint16_t                    block_size;
    uint16_t                    active_cnt;

    if (USB_NULL != ptr)
    {
        ip = ptr->ip;
    }
    else
    {
  #if USB_CFG_USE_USBIP == USB_CFG_IP0
        /* USB0 */
        ip = USB_IP0;

  #else     /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
        /* USB1/USBA */
        ip = USB_IP1;

  #endif    /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
    }

    dma_ch = usb_dma_ref_ch_no(ip, useport);

    if (USB_D0DMA == useport)
    {
        fifo_mode = USB_FIFO_TYPE_D0DMA;
    }
    else
    {
        fifo_mode = USB_FIFO_TYPE_D1DMA;
    }

    transfer_count  = ((transfer_size -1) / g_usb_cstd_dma_fifo[ip][dma_ch]) +1;
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    if (USB_IP1 == ip)
    {
        td_cfg.data_size    = DMACA_DATA_SIZE_LWORD;
        block_size      = ((g_usb_cstd_dma_fifo[ip][dma_ch] -1) /4) +1;
        fifo_address    = hw_usb_get_dxfifo_adr(ptr, fifo_mode, USB_FIFO_ACCESS_TYPE_32BIT);

        if (transfer_size < g_usb_cstd_dma_fifo[ip][dma_ch])
        {
            block_size      = ((transfer_size -1) /4) +1;
        }    }
    else
    {

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
        td_cfg.data_size    = DMACA_DATA_SIZE_WORD;
        block_size      = ((g_usb_cstd_dma_fifo[ip][dma_ch] -1) /2) +1;
        fifo_address    = hw_usb_get_dxfifo_adr(ptr, fifo_mode, USB_FIFO_ACCESS_TYPE_16BIT);

        if (transfer_size < g_usb_cstd_dma_fifo[ip][dma_ch])
        {
            block_size      = ((transfer_size -1) /2) +1;
        }
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    }

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

    vect = usb_dma_get_dxfifo_ir_vect(ptr, useport);

    active_cnt = 0;
    /* Wait for Complete of DMA transfer. */
    do
    {
        R_DMACA_Control(dma_ch, DMACA_CMD_STATUS_GET, &dmac_status);
        if(true == dmac_status.act_stat)
        {
            active_cnt = 0;
        }
        else
        {
            active_cnt ++;
        }
    }
    while(active_cnt < ACTIVE_CNT_NUMBER);

    R_DMACA_Control(dma_ch, DMACA_CMD_DTIF_STATUS_CLR, &dmac_status);

/* DMA test code start */
    /* Operation - No Extended Repeat Area Function and No Offset Subtraction */
    /* Source address is fixed
    * Transfer data size is 32-bit (long word).
    * DMAC transfer mode is Repeat mode & Source side is repeat area
    * At the beginning of transfer, clear the interrupt flag of the activation source
    to 0.
    * Transfer Request source is software. */
    /* Set Transfer data configuration. */
    td_cfg.transfer_mode  = DMACA_TRANSFER_MODE_BLOCK;
    td_cfg.repeat_block_side = DMACA_REPEAT_BLOCK_DISABLE;
    td_cfg.act_source     = (dmaca_activation_source_t)vect;
    td_cfg.request_source = DMACA_TRANSFER_REQUEST_PERIPHERAL;
    td_cfg.dtie_request   = DMACA_TRANSFER_END_INTERRUPT_DISABLE;
    td_cfg.esie_request   = DMACA_TRANSFER_ESCAPE_END_INTERRUPT_DISABLE;
    td_cfg.rptie_request  = DMACA_REPEAT_SIZE_END_INTERRUPT_DISABLE;
    td_cfg.sarie_request  = DMACA_SRC_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
    td_cfg.darie_request  = DMACA_DES_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
    td_cfg.src_addr_mode  = DMACA_SRC_ADDR_FIXED;
    td_cfg.src_addr_repeat_area = DMACA_SRC_ADDR_EXT_REP_AREA_NONE;
    td_cfg.des_addr_mode  = DMACA_DES_ADDR_INCR;
    td_cfg.des_addr_repeat_area = DMACA_DES_ADDR_EXT_REP_AREA_NONE;
    td_cfg.offset_value   = 0x00000000;
    td_cfg.interrupt_sel  = DMACA_CLEAR_INTERRUPT_FLAG_BEGINNING_TRANSFER;
    td_cfg.p_src_addr     = (void *)fifo_address;
    td_cfg.p_des_addr     = (void *)des_addr;
    td_cfg.transfer_count = transfer_count;
    td_cfg.block_size     = block_size;

    /* Call R_DMACA_Create(). */
    ret = R_DMACA_Create(dma_ch, &td_cfg);

    ret = R_DMACA_Int_Enable(dma_ch, USB_DMA_CH_PRI);
    if (DMACA_SUCCESS != ret)
    {
        /* do something */
    }

