miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_dma.c
    /* Call R_DMACA_Control().
    Enable DMAC transfer. */
    ret = R_DMACA_Control(dma_ch, DMACA_CMD_ENABLE, &dmac_status);
}
/******************************************************************************
End of function usb_dma_dxfifo2buf_setting
******************************************************************************/

/******************************************************************************
Function Name   : usb_dma_buf2dxfifo_setting
Description     : Buffer to FIFO data write DMA start
Arguments       : usb_utr_t *ptr            : Pointer to usb_utr_t structure
                : uint32_t  src_adr         : Source address
                : uint16_t  useport         : FIFO Access mode
                : uint32_t  transfer_size   : Transfer size
Return value    : none
******************************************************************************/
void usb_dma_buf2dxfifo_setting(usb_utr_t *ptr, uint32_t src_adr, uint16_t useport, uint32_t transfer_size)
{
    volatile dmaca_return_t     ret;
    dmaca_transfer_data_cfg_t   td_cfg;
    dmaca_stat_t                dmac_status;
    uint32_t                    fifo_address;
    uint16_t                    vect;
    uint16_t                    fifo_mode;
    uint16_t                    bit_width;
    uint8_t                     dma_ch;
    uint16_t                    ip;
    uint16_t                    transfer_count;
    uint16_t                    block_size;
    uint16_t                    active_cnt;

    if (USB_NULL != ptr)
    {
        ip = ptr->ip;
    }
    else
    {
  #if USB_CFG_USE_USBIP == USB_CFG_IP0
        /* USB0 */
        ip = USB_IP0;

  #else     /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
        /* USB1/USBA */
        ip = USB_IP1;

  #endif    /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
    }

    dma_ch = usb_dma_ref_ch_no(ip, useport);

    if (USB_D0DMA == useport)
    {
        fifo_mode = USB_FIFO_TYPE_D0DMA;
        if (USB_IP0 == ip)
        {
            ret = R_DMACA_Int_Callback(dma_ch, (void *) usb_ip0_d0fifo_callback);
        }
        else
        {
            ret = R_DMACA_Int_Callback(dma_ch, (void *) usb_ip1_d0fifo_callback);
        }
    }
    else
    {
        fifo_mode = USB_FIFO_TYPE_D1DMA;
        if (USB_IP0 == ip)
        {
            ret = R_DMACA_Int_Callback(dma_ch, (void *) usb_ip0_d1fifo_callback);
        }
        else
        {
            ret = R_DMACA_Int_Callback(dma_ch, (void *) usb_ip1_d1fifo_callback);
        }
    }

    if (g_usb_cstd_dma_fifo[ip][dma_ch] > transfer_size)
    {
        block_size       = transfer_size;
    }
    else
    {
        block_size       = g_usb_cstd_dma_fifo[ip][dma_ch];
    }

    transfer_count  = ((transfer_size -1) / g_usb_cstd_dma_fifo[ip][dma_ch]) +1;
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    if ((0 == (transfer_size & 0x03)) && (USB_IP1 == ip))
    {
        block_size       = ((block_size -1) /4) +1;
        bit_width        = USB_FIFO_ACCESS_TYPE_32BIT;
        td_cfg.data_size = DMACA_DATA_SIZE_LWORD;
        fifo_address     = hw_usb_get_dxfifo_adr(ptr, fifo_mode, USB_FIFO_ACCESS_TYPE_32BIT);
    }
    else
    {

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
        if (0 == (transfer_size & 0x01))
        {
            block_size       = ((block_size -1) /2) +1;
            bit_width        = USB_FIFO_ACCESS_TYPE_16BIT;
            td_cfg.data_size = DMACA_DATA_SIZE_WORD;
            fifo_address     = hw_usb_get_dxfifo_adr(ptr, fifo_mode, USB_FIFO_ACCESS_TYPE_16BIT);
        }
        else
        {
            bit_width        = USB_FIFO_ACCESS_TYPE_8BIT;
            td_cfg.data_size = DMACA_DATA_SIZE_BYTE;
            fifo_address     = hw_usb_get_dxfifo_adr(ptr, fifo_mode, USB_FIFO_ACCESS_TYPE_8BIT);
        }
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    }

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

    vect = usb_dma_get_dxfifo_ir_vect(ptr, useport);
    fifo_address = hw_usb_get_dxfifo_adr(ptr, fifo_mode, bit_width);

    active_cnt = 0;
    /* Wait for Complete of DMA transfer. */
    do
    {
        R_DMACA_Control(dma_ch, DMACA_CMD_STATUS_GET, &dmac_status);
        if(true == dmac_status.act_stat)
        {
            active_cnt = 0;
        }
        else
        {
            active_cnt ++;
        }
    }
    while(active_cnt < ACTIVE_CNT_NUMBER);

    R_DMACA_Control(dma_ch, DMACA_CMD_DTIF_STATUS_CLR, &dmac_status);

/* DMA test code start */
    /* Operation - No Extended Repeat Area Function and No Offset Subtraction */
    /* Source address is fixed
    * Transfer data size is 32-bit (long word).
    * DMAC transfer mode is Repeat mode & Source side is repeat area
    * At the beginning of transfer, clear the interrupt flag of the activation source
    to 0.
    * Transfer Request source is software. */
    /* Set Transfer data configuration. */
    td_cfg.transfer_mode        = DMACA_TRANSFER_MODE_BLOCK;
    td_cfg.repeat_block_side    = DMACA_REPEAT_BLOCK_DISABLE;
    td_cfg.act_source           = (dmaca_activation_source_t)vect;
    td_cfg.request_source       = DMACA_TRANSFER_REQUEST_PERIPHERAL;
    td_cfg.dtie_request         = DMACA_TRANSFER_END_INTERRUPT_ENABLE;
    td_cfg.esie_request         = DMACA_TRANSFER_ESCAPE_END_INTERRUPT_DISABLE;
    td_cfg.rptie_request        = DMACA_REPEAT_SIZE_END_INTERRUPT_DISABLE;
    td_cfg.sarie_request        = DMACA_SRC_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
    td_cfg.darie_request        = DMACA_DES_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
    td_cfg.src_addr_mode        = DMACA_SRC_ADDR_INCR;
    td_cfg.src_addr_repeat_area = DMACA_SRC_ADDR_EXT_REP_AREA_NONE;
    td_cfg.des_addr_mode        = DMACA_DES_ADDR_FIXED;
    td_cfg.des_addr_repeat_area = DMACA_DES_ADDR_EXT_REP_AREA_NONE;
    td_cfg.offset_value         = 0x00000000;
    td_cfg.interrupt_sel        = DMACA_CLEAR_INTERRUPT_FLAG_BEGINNING_TRANSFER;
    td_cfg.p_src_addr           = (void *)src_adr;
    td_cfg.p_des_addr           = (void *)fifo_address;
    td_cfg.transfer_count       = transfer_count;
    td_cfg.block_size           = block_size;

    /* Call R_DMACA_Create(). */
    ret = R_DMACA_Create(dma_ch, &td_cfg);

    ret = R_DMACA_Int_Enable(dma_ch, USB_DMA_CH2_PRI);
    if (DMACA_SUCCESS != ret)
    {
        /* do something */
    }

