miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_dma.c
    /* Call R_DMACA_Control().
    Enable DMAC transfer. */
    ret = R_DMACA_Control(dma_ch, DMACA_CMD_ENABLE, &dmac_status);

}
/******************************************************************************
End of function usb_dma_buf2dxfifo_setting
******************************************************************************/
#endif /* USB_CFG_DMA == USB_CFG_ENABLE */

/******************************************************************************
Function Name   : usb_dma_get_dxfifo_ir_vect
Description     : Get vector no. of USB DxFIFO
Arguments       : usb_utr_t *ptr        : Pointer to usb_utr_t structure
                : uint16_t  useport     : FIFO select
Return value    : Vector no.
******************************************************************************/
uint16_t    usb_dma_get_dxfifo_ir_vect(usb_utr_t *ptr, uint16_t use_port)
{
    uint16_t    ip;
    uint16_t    vect;

    if (USB_NULL != ptr)
    {
        ip = ptr->ip;
    }
    else
    {
  #if USB_CFG_USE_USBIP == USB_CFG_IP0
        /* USB0 */
        ip = USB_IP0;

  #else     /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
        /* USB1/USBA */
        ip = USB_IP1;

  #endif    /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
    }

    if (USB_USBIP_0 == ip)
    {
        if (USB_D0DMA == use_port)
        {
            vect = IR_USB0_D0FIFO0;
        }
        else if (USB_D1DMA == use_port)
        {
            vect = IR_USB0_D1FIFO0;
        }
        else
        {
            /* none */
        }
    }
#if USB_NUM_USBIP == 2
    else
    {
        if (USB_D0DMA == use_port)
        {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            vect = IR_USBA_D0FIFO2;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
            vect = IR_USB1_D0FIFO1;

#endif  /* defined(BSP_MCU_RX63N) */
        }
        else if (USB_D1DMA == use_port)
        {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            vect = IR_USBA_D1FIFO2;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
            vect = IR_USB1_D1FIFO1;

#endif  /* defined(BSP_MCU_RX63N) */
        }
        else
        {
            /* none */
        }
    }

#endif /* USB_NUM_USBIP == 2 */

    return vect;
}
/******************************************************************************
End of function usb_dma_get_dxfifo_ir_vect
******************************************************************************/

/******************************************************************************
Function Name   : usb_dma_clear_dxfifo_ir
Description     : Clear Interrupt status of USB DxFIFO.
Arguments       : usb_utr_t *ptr        : Pointer to usb_utr_t structure
                : uint16_t  useport     : FIFO select
Return value    : none
******************************************************************************/
void    usb_dma_clear_dxfifo_ir(usb_utr_t *ptr, uint16_t use_port)
{
    uint16_t    ip;

    if (USB_NULL != ptr)
    {
        ip = ptr->ip;
    }
    else
    {
  #if USB_CFG_USE_USBIP == USB_CFG_IP0
        /* USB0 */
        ip = USB_IP0;

  #else     /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
        /* USB1/USBA */
        ip = USB_IP1;

  #endif    /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
    }

    if (USB_USBIP_0 == ip)
    {
        if (USB_D0DMA == use_port)
        {
            IR(USB0,D0FIFO0) = 0;
        }
        else if (USB_D1DMA == use_port)
        {
            IR(USB0,D1FIFO0) = 0;
        }
        else
        {
            /* none */
        }
    }
#if USB_NUM_USBIP == 2
    else
    {
        if (USB_D0DMA == use_port)
        {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            IR(USBA,D0FIFO2) = 0;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
            IR(USB1,D0FIFO1) = 0;

#endif  /* defined(BSP_MCU_RX63N) */
        }
        else if (USB_D1DMA == use_port)
        {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            IR(USBA,D1FIFO2) = 0;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
            IR(USB1,D1FIFO1) = 0;

#endif  /* defined(BSP_MCU_RX63N) */
        }
        else
        {
            /* None */
        }
    }

#endif /* USB_NUM_USBIP == 2 */
}
/******************************************************************************
End of function usb_dma_clear_dxfifo_ir
******************************************************************************/

/******************************************************************************
Function Name   : usb_dma_stop_dxfifo
Description     : DMA stop
Arguments       : uint8_t   ip_type     : USB_IP0/USB_IP1
                : uint16_t  use_port    : FIFO select
Return value    : void
******************************************************************************/
void usb_dma_stop_dxfifo(uint8_t ip_type, uint16_t use_port)
{
    uint16_t    active_cnt;
#if USB_CFG_DTC == USB_CFG_ENABLE
    dtc_stat_t      stat;
    dtc_cmd_arg_t   args;
    usb_utr_t       utr;

    active_cnt = 0;
    /* Wait for Complete of DTC transfer. */
    do
    {
        R_DTC_Control(DTC_CMD_STATUS_GET, &stat, &args);
        if(true == stat.in_progress)
        {
            active_cnt = 0;
        }
        else
        {
            active_cnt ++;
        }
    }
    while(active_cnt < ACTIVE_CNT_NUMBER);

    

    if (USB_IP0 == ip_type)
    {
        /* DTC start enable register (USB0 D0FIFO transfer disable)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
        if (USB_D0DMA == use_port)
        {
            DTCE (USB0, D0FIFO0) = 0;
            IPR (USB0, D0FIFO0) = 0u;                   /* D0FIFO0 Disable */
        }
        else
        {
            DTCE (USB0, D1FIFO0) = 0;
            IPR (USB0, D1FIFO0) = 0u;                   /* D0FIFO0 Disable */
        }
    }
    else
    {
        /* DTC start enable register (USBA D0FIFO transfer disable)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
        if (USB_D0DMA == use_port)
        {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            DTCE (USBA, D0FIFO2) = 0;
            IPR (USBA, D0FIFO2) = 0u;                   /* D0FIFO0 Disable */

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
            DTCE (USB1, D0FIFO1) = 0;
            IPR (USB1, D0FIFO1) = 0u;                   /* D0FIFO0 Disable */

