miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_dma.c
#endif  /* defined(BSP_MCU_RX63N) */
        }
        else
        {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            DTCE (USBA, D1FIFO2) = 0;
            IPR (USBA, D1FIFO2) = 0u;                   /* D0FIFO0 Disable */

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
            DTCE (USB1, D1FIFO1) = 0;
            IPR (USB1, D1FIFO1) = 0u;                   /* D0FIFO0 Disable */

#endif  /* defined(BSP_MCU_RX63N) */
        }
    }

    utr.ip = ip_type;
    usb_dma_clear_dxfifo_ir(&utr, use_port);

#endif  /* USB_CFG_DTC == USB_CFG_ENABLE */

#if USB_CFG_DMA == USB_CFG_ENABLE
    dmaca_stat_t                dmac_status;
    uint8_t                     dma_ch;

    dma_ch = usb_dma_ref_ch_no(ip_type, use_port);  /* Get DMA channel no. */

    active_cnt = 0;
    /* Wait for Complete of DMA transfer. */
    do
    {
        R_DMACA_Control(dma_ch, DMACA_CMD_STATUS_GET, &dmac_status);
        if(true == dmac_status.act_stat)
        {
            active_cnt = 0;
        }
        else
        {
            active_cnt ++;
        }
    }
    while(active_cnt < ACTIVE_CNT_NUMBER);

    R_DMACA_Control(dma_ch, DMACA_CMD_DTIF_STATUS_CLR, &dmac_status); /* Clear DMA status */

#endif  /* USB_CFG_DMA == USB_CFG_ENABLE */

}
/******************************************************************************
End of function usb_dma_stop_dxfifo
******************************************************************************/

/******************************************************************************
Function Name   : usb_dma_set_ch_no
Description     : Set DMA channel no.
Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure
                : uint16_t useport  : FIFO select
                : uint8_t dma_ch_no : DMA channel no.
Return value    : none
******************************************************************************/
void        usb_dma_set_ch_no(uint16_t ip_no, uint16_t use_port, uint8_t dma_ch_no)
{
    g_usb_cstd_dma_ch[ip_no][use_port] = dma_ch_no;  /* DMA ch no. table */
}
/******************************************************************************
End of function usb_dma_set_ch_no
******************************************************************************/

/******************************************************************************
Function Name   : usb_dma_ref_ch_no
Description     : Get DMA channel no.
Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure
                : uint16_t  useport : FIFO select
Return value    : DMA channel no.
******************************************************************************/
uint8_t     usb_dma_ref_ch_no(uint16_t ip_no, uint16_t use_port)
{
    return g_usb_cstd_dma_ch[ip_no][use_port];  /* DMA ch no. table */
}
/******************************************************************************
End of function usb_dma_ref_ch_no
******************************************************************************/

/******************************************************************************
Function Name   : usb_dma_buf2dxfifo_complete_event_set
Description     : Set event for DMA transfer complete of Buffer to DxFIFO.
Arguments       : uint16_t ip_no  : IP no.(USB_IP0/USB_IP1)
                : uint16_t useport: FIFO select(USB_D0DMA/USB_D1DMA)
Return value    : none
******************************************************************************/
void usb_dma_buf2dxfifo_complete_event_set(uint16_t ip_no, uint16_t use_port)
{
#if (BSP_CFG_RTOS_USED == 1)

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    usb_utr_t   *p_host;
    usb_utr_t   utr;
#endif
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
//    usb_int_t   *p_peri;
    usb_utr_t   *p_peri;
#endif

    if (USB_HOST == g_usb_usbmode)
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        utr.ip = ip_no;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);

        hw_usb_clear_dreqe(&utr, use_port);       /* DMA Transfer request disable */

        p_host          = (usb_utr_t *)get_usb_int_buf();
        p_host->ip      = ip_no;
        p_host->msginfo = USB_MSG_HCD_INT;
        p_host->keyword = USB_INT_DXFIFO;
        p_host->status  = use_port;

        p_host->ipp     = utr.ipp;
        USB_ISND_MSG(USB_HCD_MBX, (usb_msg_t *)p_host);
#endif  /* ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST) */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        hw_usb_clear_dreqe(USB_NULL, use_port);       /* DMA Transfer request disable */

//        p_peri              = (usb_int_t *)get_usb_int_buf();
        p_peri              = (usb_utr_t *)get_usb_int_buf();
        p_peri->ip          = ip_no;
//        p_peri->type        = USB_INT_DXFIFO;
//        p_peri->fifo_type   = use_port;
        p_peri->msginfo     = USB_MSG_PCD_INT;
        p_peri->keyword     = USB_INT_DXFIFO;
        p_peri->status      = use_port;

        USB_ISND_MSG(USB_PCD_MBX, (usb_msg_t *)p_peri);
#endif  /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */
    }


#else   /* (BSP_CFG_RTOS_USED == 1) */


#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    usb_utr_t   utr;
#endif  /* ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST ) */
    g_usb_cstd_dma_int.buf[g_usb_cstd_dma_int.wp].ip = ip_no;
    g_usb_cstd_dma_int.buf[g_usb_cstd_dma_int.wp].fifo_type = use_port;
    g_usb_cstd_dma_int.wp = ((g_usb_cstd_dma_int.wp+1) % USB_INT_BUFSIZE);

    if (USB_HOST == g_usb_usbmode)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        utr.ip = ip_no;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);

        hw_usb_clear_dreqe(&utr, use_port);       /* DMA Transfer request disable */

#endif  /* ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST ) */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        hw_usb_clear_dreqe(USB_NULL, use_port);       /* DMA Transfer request disable */

#endif  /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */
    }
#endif  /* (BSP_CFG_RTOS_USED == 1) */
}
/******************************************************************************
End of function usb_dma_buf2dxfifo_complete_event_set
******************************************************************************/

