miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_dma.c
/*******************************************************************************
* Function Name: usb_ip0_d0fifo_callback
* Description  : Interrupt service routine of D0FIFO
* Arguments    : none
* Return Value : none
*******************************************************************************/
void usb_ip0_d0fifo_callback (void)
{
    usb_dma_buf2dxfifo_complete_event_set(USB_IP0, USB_D0DMA);
}
/******************************************************************************
End of function usb_ip0_d0fifo_callback
******************************************************************************/

/*******************************************************************************
* Function Name: usb_ip0_d1fifo_callback
* Description  : Interrupt service routine of D1FIFO
* Arguments    : none
* Return Value : none
*******************************************************************************/
void usb_ip0_d1fifo_callback (void)
{
    usb_dma_buf2dxfifo_complete_event_set(USB_IP0, USB_D1DMA);
}
/******************************************************************************
End of function usb_ip1_d0fifo_callback
******************************************************************************/

/*******************************************************************************
* Function Name: usb_ip1_d0fifo_callback
* Description  : Interrupt service routine of D0FIFO
* Arguments    : none
* Return Value : none
*******************************************************************************/
void usb_ip1_d0fifo_callback (void)
{
    usb_dma_buf2dxfifo_complete_event_set(USB_IP1, USB_D0DMA);
}
/******************************************************************************
End of function usb_ip1_d0fifo_callback
******************************************************************************/

/*******************************************************************************
* Function Name: usb_ip1_d1fifo_callback
* Description  : Interrupt service routine of D1FIFO
* Arguments    : none
* Return Value : none
*******************************************************************************/
void usb_ip1_d1fifo_callback (void)
{
    usb_dma_buf2dxfifo_complete_event_set(USB_IP1, USB_D1DMA);
}
/******************************************************************************
End of function usb_ip1_d1fifo_callback
******************************************************************************/

/******************************************************************************
Function Name   : hw_usb_get_dxfifo_adr
Description     : Get FIFO port address of DMA/DTC.
Arguments       : usb_utr_t *ptr        : Pointer to usb_utr_t structure
                : uint16_t  use_port    : FIFO select
                : uint16_t  bit_width   : Access bit size of USB DxFIFO
Return          : Address of FIFO port.
******************************************************************************/
uint32_t hw_usb_get_dxfifo_adr(usb_utr_t *ptr, uint16_t use_port, uint16_t bit_width)
{
    uint32_t    address;
    uint8_t     ip;
    


    if (USB_NULL != ptr)
    {
        /* Host mode */
        if (USB_IP0 == ptr->ip)
        {
            ip = USB_IP0;
        }
        else
        {
            ip = USB_IP1;
        }
    }
    else
    {
        /* Peri mode */
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        /* USB0 */
        ip = USB_IP0;
#else
        /* USB1/USBA */
        ip = USB_IP1;
#endif
    }

    address = g_fifo_address[ip][use_port][bit_width];      /* Set address of FIFO port */
    return address;
}
/******************************************************************************
End of function hw_usb_get_dxfifo_adr
******************************************************************************/

/******************************************************************************
Function Name   : usb_dma_get_crtb
Description     : Get DMA Current Transaction Byte reg B(CRTB).
Arguments       : uint16_t dma_ch : DMA Channel no.
Return value    : DMA Current Transaction Byte reg B(CRTB)
******************************************************************************/
uint16_t usb_dma_get_crtb(uint16_t dma_ch)
{
#if USB_CFG_DTC == USB_CFG_ENABLE
    uint16_t value;
    uint16_t status_reg = 0;

    /* Wait Complete DTC Transfer */
    do
    {
        status_reg = DTC.DTCSTS.WORD;
    }
    while( 0 != ( status_reg & 0x8000 ) );  /* DTC is not active */
 
    /* Read DTC transfer count (CRB) */
    value = (uint16_t)(g_usb_dtc_transfer_data[dma_ch].lw4 & 0xffff);
    
    return value;

#endif  /* USB_CFG_DTC == USB_CFG_ENABLE */

#if USB_CFG_DMA == USB_CFG_ENABLE
    dmaca_stat_t                dmac_status;

    R_DMACA_Control(dma_ch, DMACA_CMD_STATUS_GET, &dmac_status);

    return dmac_status.transfer_count;

#endif  /* USB_CFG_DTC == USB_CFG_ENABLE */
}
/******************************************************************************
End of function usb_dma_get_crtb
******************************************************************************/

#endif  /* ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE)) */

/******************************************************************************
End of file
******************************************************************************/
